# HasExtension Property (2022)

---
C#Visual BasicVisual C++
Revit 2022 API
---
AnalyticalModelSurface..::..HasExtension Property
AnalyticalModelSurface Class See Also
---
Indicates if the element supports an extension option.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)**Since:** 2015
# Syntax
C#
---
```text
public bool HasExtension { get; }
```

Visual Basic
---
```text
Public ReadOnly Property HasExtension As Boolean
	Get
```

Visual C++
---
```text
public:
property bool HasExtension {
	bool get ();
}
```

# Remarks
Analytical model elements for walls support extension options, while those for floor or slabs do not.
# See Also
AnalyticalModelSurface Class
Autodesk.Revit.DB.Structure Namespace